MikePythons/circuitpython/ports/raspberrypi/boards/mikepython_rp2040smol/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "MikePython RP2040smol"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO17)

